Sources/interTwoPhaseCentralFoam/tutorial/damBreak/damBreak_with_viscousity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho1|rho2|volumeFraction1|U|T|p_rgh|pcorr).*"
    {
        solver          PBiCGStab;
        preconditioner	diagonal none;
        tolerance       1e-9;
        relTol          0.0;
        cAlpha          1.0;
        nAlphaCorr      1;
    }
}

PIMPLE
{

    nOuterCorrectors            3;
    nCorrectors                 1;

    kappaFunction
    {
        type standardMachToAcCourantRatio;
        standardMachToAcCourantRatioCoeffs
        {
            writeMaxMin false;
        }
    }
}

// ************************************************************************* //
